Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: For convenience (and historical compatibility) the three most common quantifiers have single-character abbreviations: * is equivalent to {0,} + is equivalent to {1,}? is equivalent to {0,1} It is possible to construct infinite loops by following a subpattern that can match no characters with a quantifier that has no upper limit, for example: (a ?)* Earlier versions of Perl and PCRE used to give an error atFor convenience (and historical compatibility) the three most common quantifiers have single-character abbreviations: * is equivalent to {0,} + is equivalent to {1,}? is equivalent to {0,1} It is possible to construct infinite loops by following a subpattern that can match no characters with a quantifier that has no upper limit, for example: (a? )* Earlier versions of Perl and PCRE used to give an error at compile time for such patterns.
es: Por conveniencia (y compatibilidad histórica) los cuantificadores más comunes tienen abreviaciones de un solo carácter. * es equivalente a {0,} + es equivalente a {1,}? es equivalente a {0,1} Es posible construir bucles infinitos mediante un subpatrón que pueda casar ningún carácter con un cuantificador que no tenga límite superior, por ejemplo: (a ?)* Las primeras versiones de Perl y PCRE dan un error en tiempo de compilaciónPor conveniencia (y compatibilidad histórica) los cuantificadores más comunes tienen abreviaciones de un solo carácter. * es equivalente a {0,} + es equivalente a {1,}? es equivalente a {0,1} Es posible construir bucles infinitos mediante un subpatrón que pueda casar ningún carácter con un cuantificador que no tenga límite superior, por ejemplo: (a? )* Las primeras versiones de Perl y PCRE dan un error en tiempo de compilación para tales patrones.

source: However, because there are cases where this can be useful, such patterns are now accepted, but if any repetition of the subpattern does in fact match no characters, the loop is forcibly broken.
es: Sin embargo, ya que existen casos donde esto puede ser útil, esto patrones son aceptados ahora, pero si cualquier repetición del subpatrón no casa ningún carácter, el bucle es roto.

source: By default, the quantifiers are "greedy", that is, they match as much as possible (up to the maximum number of permitted times), without causing the rest of the pattern toBy default, the quantifiers are "greedy", that is, they match as much as possible (up to the maximum number of permitted times), without causing the rest of the pattern to fail.
es: Por defecto, los cuantificadores son "codiciosos", esto es, casan tantas veces como les es posible (hasta el número máximo de veces permitido), sinPor defecto, los cuantificadores son "codiciosos", esto es, casan tantas veces como les es posible (hasta el número máximo de veces permitido), sin provocar que el resto del patrón falle.

source: The classic example of where this gives problems is inThe classic example of where this gives problems is in trying to match comments in C programs.
es: El ejemplo clásico de donde viene este problema es en intentar casar comentarios en los programas en C.

source: These appear between the sequences / * and * / and within the sequence, individualThese appear between the sequences / * and * / and within the sequence, individual * and / characters may appear.
es: Estos aparecen entre las secuencias / * y * / y dentro de la secuencia losEstos aparecen entre las secuencias / * y * / y dentro de la secuencia los caracteres * y / pueden aparecer individualmente.

source: However, if a quantifier is followed by a question mark, then it ceases to be greedy, and instead matches the minimum number of times possible, so the pattern / \*.*?\* / However, if a quantifier is followed by a question mark, then it ceases to be greedy, and instead matches the minimum number of times possible, so the pattern / \*.*?\* / does the right thing with the C comments.
es: Un modo de casar comentarios en C es aplicando el patrón / \*.*\* / para la cadena / * first command * / not comment / * second comment * / falla, porque casa la cadena entera debido a la voracidad del elemento .* Sin embargo, si un cuantificador le siguw un signo de interrogación entonces cesa la voracidad y empareja el mínimo número de veces posibles, así el patrón / \*.*?\* / Un modo de casar comentarios en C es aplicando el patrón / \*.*\* / para la cadena / * first command * / not comment / * second comment * / falla, porque casa la cadena entera debido a la voracidad del elemento .* Sin embargo, si un cuantificador le siguw un signo de interrogación entonces cesa la voracidad y empareja el mínimo número de veces posibles, así el patrón / \*.*?\* / hace las cosas correctamente con los comentarios en C.

source: The meaning of the various quantifiers is not otherwise changed, just the preferredThe meaning of the various quantifiers is not otherwise changed, just the preferred number of matches.
es: El significado de los cuantificadores variables no es cambiado en otro modo, justo el númeroEl significado de los cuantificadores variables no es cambiado en otro modo, justo el número preferido de casamientos.

source: Do not confuse this use of ques - tion mark with its use as a quantifier in its own right.
es: No confundas el uso de las interrogaciones conNo confundas el uso de las interrogaciones con su uso como un cuantificador mas.

source: Because it has two uses, it can sometimes appear doubled, as in \d??\d which matches one digit by preference, but can match two if that is the only way the rest of the pattern matches.
es: Ya que tiene dos usos, a veces puede parecer doble, como en \d??\d el cual empareja un dígito normalmente, pero puede casar dos si ese el único modo de casar el resto del patrón.

source: If the PCRE_UNGREEDY option is set (an option which is not available in Perl) then the quantifiers are not greedy by default, but individual ones can be made greedy by followingIf the PCRE_UNGREEDY option is set (an option which is not available in Perl) then the quantifiers are not greedy by default, but individual ones can be made greedy by following them with a question mark.
es: Si se define la opción PCRE_UNGREEDY (la cual no es posible en Perl) entonces los cuantificadores no son voraces por defecto, pero uno puedeSi se define la opción PCRE_UNGREEDY (la cual no es posible en Perl) entonces los cuantificadores no son voraces por defecto, pero uno puede serlo seguido por una interrogación.

source: In other words, it inverts the default behaviour.
es: En otras palabras, invierte la conducta por defecto.

source: When a parenthesized subpattern is quantified with a minimum repeat count that is greater than 1 or with a limited maximum, more store is required for the compiled pattern, in proportion to the size of the minimum or maximum.
es: Cuando un subpatrón entre paréntesis es cuantificado con un número mínimo de repeticiones superior a uno o con un límite máximo, se necesita más almacenamiento para compilar el patrón, en proporción al tamaño del mínimo o del máximo.

source: PCRE treats such a pattern as though it were preceded by \A.
es: Si un patrón empieza con .* o .{ 0,} y la opción PCRE_DOTALL (equivalente a / s del Perl) es definida, esta permitiendo el. para casar nuevas líneas,Si un patrón empieza con .* o .{0,} y la opción PCRE_DOTALL (equivalente a / s del Perl) es definida, esta permitiendo el. para casar nuevas líneas, entonces el patrón es anclado implícitamente.

source: In cases where it is known that the subject string contains no newlines, it is worth setting PCRE_DOTALL when the pattern begins with .* in order to obtain this optimization, or alternatively using ^ to indicate anchoring explicitly.
es: PCRE trata tales patronesPCRE trata tales patrones como si estuvieran precedidos por \A.

source: For example, after (tweedle[dume]{3}\s*) + has matched "tweedledum tweedledee "the value of the capturedFor example, after (tweedle[dume]{3}\s*) + has matched "tweedledum tweedledee" the value of the captured substring is "tweedledee ".
es: En los casos donde se conoce que la cadena de entrada no contiene nuevas líneas, es conveniente definir PCRE_DOTALL cuando el patrón empieza con .* para obtener esta optimización o usar ^ para indicar explícitamente anclamiento.

source: However, if there are nested capturing subpatterns, the corresponding capturedHowever, if there are nested capturing subpatterns, the corresponding captured values may have been set in previous iterations.
es: Cuando un subpatrón capturado es repetido, el valor capturado es laCuando un subpatrón capturado es repetido, el valor capturado es la subcadena que empareja la iteración final.

source: Outside a character class, a backslash followed by a digit greater than 0 (and possibly further digits) is a back reference to a capturing subpattern earlier (i.e. to its left) in the pattern, provided there have been that many previous capturing left parentheses.
es: Por ejemplo, el patrón (tweedle[dume]{3}\s*) + con la cadena de entrada "tweedledum tweedledee "el valor de la subcadenaPor ejemplo, el patrón (tweedle[dume]{3}\s*) + con la cadena de entrada "tweedledum tweedledee" el valor de la subcadena capturada es "tweedledee ".

source: However, if the decimal number following the backslash is less than 10, it is always taken as a back reference, and causes an error only if there are not that many capturingHowever, if the decimal number following the backslash is less than 10, it is always taken as a back reference, and causes an error only if there are not that many capturing left parentheses in the entire pattern.
es: Sin embargo, si hay subpatrones capturados anidadamente, los valores capturados correspondientes pueden haber sidoSin embargo, si hay subpatrones capturados anidadamente, los valores capturados correspondientes pueden haber sido definidos en las iteraciones anteriores.

source: In other words, the parentheses that are referenced need not be to the left ofIn other words, the parentheses that are referenced need not be to the left of the reference for numbers less than 10.
es: Por ejemplo, después de casar "aba" con / (a_BAR_(b))+ / el valor de la segunda subcadena capturada es "b ".

source: A back reference matches whatever actually matched the capturing subpattern in the current subject string, rather thanA back reference matches whatever actually matched the capturing subpattern in the current subject string, rather than anything matching the subpattern itself.
es: REFERENCIAS ATRAS Fuera de una clase carácter, una barra invertida seguida por un digito mayor que cero (y posiblemente más dígitos) es una referencia atrás a un subpatrón capturado antes (a su izquierda) en el patrón, siempre que haya habido tantos paréntesis a la izquierda capturados.

source: If caseful matching is in force at the time of the back reference, thenIf caseful matching is in force at the time of the back reference, then the case of letters is relevant.
es: Sin embargo, si el número decimal seguido por la barra invertida es menor que diez, siempre es tomado como una referencia atrás, y da error sólo siSin embargo, si el número decimal seguido por la barra invertida es menor que diez, siempre es tomado como una referencia atrás, y da error sólo si no hay los suficientes subpatrones capturados en todo el patrón.

source: There may be more than one back reference to the same subpattern.
es: En otras palabras, los paréntesis que son referidos no necesitan estar a laEn otras palabras, los paréntesis que son referidos no necesitan estar a la izquierda de la referencia para un número menor de diez.

source: If a subpattern has not actually been used in a particular match, then any back references to it alwaysIf a subpattern has not actually been used in a particular match, then any back references to it always fail.
es: Examina la sección anterior titulada "Barra invertida" para más detalles del manejo de los dígitos con la barra invertida.

source: Because there may be up to 99 back references, all digits following the backslash are taken as part of a potentialBecause there may be up to 99 back references, all digits following the backslash are taken as part of a potential back reference number.
es: Una referencia atrás empareja si casa el subpatrón capturado en el actual punto de la cadena de entrada, mejor que casar cualquier subpatrón de laUna referencia atrás empareja si casa el subpatrón capturado en el actual punto de la cadena de entrada, mejor que casar cualquier subpatrón de la misma.

source: If the PCRE_EXTENDED option is set, this canIf the PCRE_EXTENDED option is set, this can be whitespace.
es: Así el patrón (sens_BAR_respons)e and \1ibility casa con "sense and sensibility "y "response and responsi bility", peroAsí el patrón (sens_BAR_respons)e and \1ibility casa con "sense and sensibility" y "response and responsi bility", pero no "sense and responsibility ".

source: A back reference that occurs inside the parentheses to which it refers fails when the subpattern is first used, so, forA back reference that occurs inside the parentheses to which it refers fails when the subpattern is first used, so, for example, (a\1) never matches.
es: Si el casamiento con la distinción entre minúsculas y mayúsculas está activado en el momento de la referencia atrás,Si el casamiento con la distinción entre minúsculas y mayúsculas está activado en el momento de la referencia atrás, entonces la distinción de las letras es relevante.

source: For example, the pattern (a_BAR_b\1)+For example, the pattern (a_BAR_b\1) + matches any number of "a"s and also "aba", "ababaa "etc.
es: Por ejemplo, ((?i)rah)\s+\1 casa con "rah rah "y "RAH RAH", pero no "RAH rah", pero el subpatrón capturado originalmente es emparejado sin la distinción.

source: At each iteration of the subpattern, the back reference matches the character string corresponding to the previous iteration.
es: Puede haber más de una referencia atrás en el mismo subpatrón.

source: In order for this to work, the pattern must be such that the first iteration does not need to match the backIn order for this to work, the pattern must be such that the first iteration does not need to match the back reference.
es: Si un subpatrón no ha sido usado en un emparejamiento particular, entoncesSi un subpatrón no ha sido usado en un emparejamiento particular, entonces cualquier referencia atrás siempre fallara.

source: This can be done using alternation, as in the example above, or by a quantifier with a minimum of zero.
es: Por ejemplo, el patrón (a_BAR_(bc))\2Por ejemplo, el patrón (a_BAR_(bc))\2 fallará siempre si inicia a casar con "a "mejor que con "bc".

source: An assertion is a test on the characters following or preceding the current matching point that does not actuallyAn assertion is a test on the characters following or preceding the current matching point that does not actually consume any characters.
es: Ya que puede haber hasta 99 referencias atrás, todos los dígitos seguidos por una barra invertida son tomados como parte de número potencial de referencias atrás.

source: More complicatedMore complicated assertions are coded as subpatterns.
es: Si el patrón continua con un carácter de dígito, entonces algún delimitadorSi el patrón continua con un carácter de dígito, entonces algún delimitador debe ser usado para terminar la referencia atrás.

source: There are two kinds: those that look ahead of the current position in the subject string, and those that look behind it.
es: Si la opción PCRE_EXTENDEDSi la opción PCRE_EXTENDED es definida, este puede ser el espacio en blanco.

source: Lookahead assertions start with (?= for positiveLookahead assertions start with (?= for positive assertions and (?! for negative assertions.
es: Una referencia atrás ocurre dentro del paréntesis al cual refiere, falla cuando el subpatrón es usado por primera vez, así por ejemplo, (a\1) nuncaUna referencia atrás ocurre dentro del paréntesis al cual refiere, falla cuando el subpatrón es usado por primera vez, así por ejemplo, (a\1) nunca emparejará.

source: Note that the apparently similar pattern (?!foo)bar does not find an occurrence of "bar "that is preceded by something other than "foo"; it finds any occurrence of "bar" whatsoever, because the assertion (?!foo) is always TRUE Note that the apparently similar pattern (?!foo)bar does not find an occurrence of "bar "that is preceded by something other than "foo"; it finds any occurrence of "bar" whatsoever, because the assertion (?!foo) is always TRUE when the next three characters are "bar ".
es: Sin embargo, tal referencia puede ser útil dentro de losSin embargo, tal referencia puede ser útil dentro de los subpatrones repetidos.

source: Lookbehind assertions start with (? = for positive assertionsLookbehind assertions start with (? = for positive assertions and (?! for negative assertions.
es: Por ejemplo, el patrón (a_BAR_b\1)+Por ejemplo, el patrón (a_BAR_b\1) + casa con cualquier número de "a"s y también con "aba", "ababaa "etc.

source: For example, (? !foo)bar does find an occurrence of "bar "that is not preceded byFor example, (? !foo)bar does find an occurrence of "bar" that is not preceded by "foo ".
es: Para cada iteración del subpatrón, la referencia atrás casa la cadena dePara cada iteración del subpatrón, la referencia atrás casa la cadena de caracteres correspondiente a la iteración anterior.

source: The contents of a lookbehind assertion are restricted such that all the strings it matches must have a fixedThe contents of a lookbehind assertion are restricted such that all the strings it matches must have a fixed length.
es: Para que esto trabaje, el patrón debe ser tal que la primera iteración no necesite casar la referenciaPara que esto trabaje, el patrón debe ser tal que la primera iteración no necesite casar la referencia atrás.

source: However, if there are several alternatives, they doHowever, if there are several alternatives, they do not all have to have the same fixed length.
es: Esto puede hacerse usando alternativas, como en el ejemplo anterior, o por medio de cuantificadores con un número mínimo de cero.

source: Branches that match different length strings are permitted only at the top level ofBranches that match different length strings are permitted only at the top level of a lookbehind assertion.
es: SENTENCIAS Una sentencia es un test sobre los caracteres siguiendo o precediendo elSENTENCIAS Una sentencia es un test sobre los caracteres siguiendo o precediendo el punto actual de emparejamiento que no consume caracteres.

source: This is an extension compared with Perl 5.005, which requires all branches to match the sameThis is an extension compared with Perl 5.005, which requires all branches to match the same length of string.
es: Las sentenciasLas sentencias codificadas como \b, \B, \A, \Z, \z, ^ y $son descritas después.

source: If there are insufficient characters before the current position, theIf there are insufficient characters before the current position, the match is deemed to fail.
es: LasLas sentencias más complejas son codificadas como subpatrones.

source: Several assertions (of any sort) may occur in succession.
es: Hay dos clases: aquellas que condicionan más adelante de la posición actual en la cadena de entrada (lookahead)y las que lo hacen en este punto (lookbehind).

source: Notice that each of the assertions is applied independentlyNotice that each of the assertions is applied independently at the same point in the subject string.
es: Un subpatrón de sentencia es emparejado del modo típico, excepto que noUn subpatrón de sentencia es emparejado del modo típico, excepto que no hace que el punto actual de emparejamiento cambie.

source: This pattern does not match "foo" preceded by six characters, the first of which are digits and the last threeThis pattern does not match "foo "preceded by six characters, the first of which are digits and the last three of which are not "999".
es: Sentencias que condicionan más adelante empiezan con (?= para sentencias afirmativas y (?! para las negativas \w+(?=;) empareja una palabra seguida por un punto y coma. pero no incluye el punto y coma en el casamiento, y foo(?!bar)Sentencias que condicionan más adelante empiezan con (?= para sentencias afirmativas y (?! para las negativas \w+(?=;) empareja una palabra seguida por un punto y coma. pero no incluye el punto y coma en el casamiento, y foo(?!bar) casa cualquier ocurrencia de "foo "que no es seguida por "bar".

source: A pattern to do that is (? =\d{3}.. .)(? !999)foo This time the first assertion looks at the preceding six characters, checking that the first three are digits, and then the second assertion checks that the preceding three characters are not "999 ".
es: Ten en cuenta que el patrón similar (?!foo)bar no encuentra una ocurrencia de "bar "que es precedida por algo que no sea "foo"; encuentra cualquier ocurrencia de "bar", ya que la sentencia (?!foo) es siempreTen en cuenta que el patrón similar (?!foo)bar no encuentra una ocurrencia de "bar" que es precedida por algo que no sea "foo"; encuentra cualquier ocurrencia de "bar", ya que la sentencia (?!foo) es siempre verdadera cuando los tres primeros caracteres son "bar ".

source: For example, (? =(? !foo)bar)baz matches an occurrence of "baz "that is preceded by "bar" which in turn is not preceded by "foo", while (? =\d{3}(?!999).. .)foo is another pattern which matches "foo "preceded by three digits and any three characters that are not "999".
es: Las sentencias de punto actual empiezan con (? = para sentencias afirmativas y (?! para lasLas sentencias de punto actual empiezan con (? = para sentencias afirmativas y (?! para las negativas.

source: Assertion subpatterns are not capturing subpatterns, and may not be repeated, because it makes no sense to assert theAssertion subpatterns are not capturing subpatterns, and may not be repeated, because it makes no sense to assert the same thing several times.
es: Por ejemplo, (? !foo)bar encuentra una ocurrencia de "bar "que no es precedida por "foo".

source: If any kind of assertion contains capturing subpatterns within it, these are counted for the purposes of numbering the capturing subpatterns in the wholeIf any kind of assertion contains capturing subpatterns within it, these are counted for the purposes of numbering the capturing subpatterns in the whole pattern.
es: Los contenidos de un sentencia de punto actual están limitados para que todasLos contenidos de un sentencia de punto actual están limitados para que todas las cadenas que emparejen deban tener una longitud fijada.

source: However, substring capturing is carried out only for positive assertions, because it does not make sense for negative assertions.
es: Sin embargo, siSin embargo, si hay varias alternativas, no todas tienen que tener la misma longitud.

source: With both maximizing and minimizing repetition, failure of what follows normally causes the repeated item to be re - evaluated to see if a different number of repeats allows theWith both maximizing and minimizing repetition, failure of what follows normally causes the repeated item to be re - evaluated to see if a different number of repeats allows the rest of the pattern to match.
es: Opciones que emparejen diferentes longitudes de cadenas son permitidas sólo a nivel superior de la sentenciaOpciones que emparejen diferentes longitudes de cadenas son permitidas sólo a nivel superior de la sentencia de punto actual.
